

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр укбп_ОстаткиЛимитовПоСведениямУФК Приход
	Движения.укбп_ОстаткиЛимитовПоСведениямУФК.Записывать = Истина;
	Движения.укбп_ОстаткиЛимитовПоСведениямУФК.Очистить();
	Для Каждого ТекСтрокаСтатьиСведений Из СтатьиСведений Цикл
		Движение = Движения.укбп_ОстаткиЛимитовПоСведениямУФК.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.БанковскийСчет = БанковскийСчет;
		Движение.ДетализированныйКодСведений = ТекСтрокаСтатьиСведений.СтатьяСведений;
		Движение.УкрупненныйКодСведений = ТекСтрокаСтатьиСведений.СтатьяСведений.УкрупненныйКодСведений;
		Движение.СуммаСведения = ТекСтрокаСтатьиСведений.СуммаСведения;
		Движение.ЛимитРасходаПоСведениям = ТекСтрокаСтатьиСведений.ЛимитРасходаПоСведениям;		
	КонецЦикла;
	
КонецПроцедуры