

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Предоставляет информацию о действующим статусе для банковского счета
//
// Возвращаемое значение:
//   <Перечисления.укбп_СтатусыСведенийУФК>   - текущий статус для банковского счета
//
Функция ПолучитьТекущийСтатусБанковскогоСчета()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	укбп_СтатусыБанковскихСчетовДляСведенийУФКСрезПоследних.Статус
	|ИЗ
	|	РегистрСведений.укбп_СтатусыБанковскихСчетовДляСведенийУФК.СрезПоследних(, БанковскийСчет = &БанковскийСчет) КАК укбп_СтатусыБанковскихСчетовДляСведенийУФКСрезПоследних";
	
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	Если Выборка.Следующий() Тогда			
		ТекущийСтатус = Выборка.Статус;			
	Иначе
		ТекущийСтатус = Перечисления.укбп_СтатусыСведенийУФК.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ТекущийСтатус;
	
КонецФункции // ПолучитьТекущийСтатусБанковскогоСчета()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр укбп_ОстаткиЛимитовПоСведениямУФК Приход
	Движения.укбп_ОстаткиЛимитовПоСведениямУФК.Записывать = Истина;
	Движения.укбп_ОстаткиЛимитовПоСведениямУФК.Очистить();
	Для Каждого ТекСтрокаСтатьиСведений Из СтатьиСведений Цикл
		Движение = Движения.укбп_ОстаткиЛимитовПоСведениямУФК.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.БанковскийСчет = БанковскийСчет;
		Движение.ДетализированныйКодСведений = ТекСтрокаСтатьиСведений.СтатьяСведений;
		Движение.УкрупненныйКодСведений = ТекСтрокаСтатьиСведений.СтатьяСведений.УкрупненныйКодСведений;
		Движение.СуммаСведения = ТекСтрокаСтатьиСведений.СуммаСведения;
		Движение.ЛимитРасходаПоСведениям = ТекСтрокаСтатьиСведений.ЛимитРасходаПоСведениям;		
	КонецЦикла;
	
КонецПроцедуры